In [1]:
import pandas as pd

In [2]:
movie_cols = ['movie_id','title']
movies = pd.read_table('u.item.txt', sep='|', header=None, names=movie_cols, usecols=[0,1])
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [3]:
movies.shape

(1682, 2)

In [4]:
# to display count of unique value in column movie_id
movies.movie_id.nunique()

1682

In [5]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('u.data.txt', sep='\t', header=None, names=rating_cols)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [6]:
ratings.shape

(100000, 4)

In [7]:
ratings.movie_id.nunique()
# same as movies DataFrame

1682

In [8]:
# to display there are multiple user_id gave rating to movie_id 1
ratings.loc[ratings.movie_id == 1, :].head(10)

      user_id  movie_id  rating  timestamp
24        308         1       4  887736532
454       287         1       5  875334088
957       148         1       4  877019411
971       280         1       4  891700426
1324       66         1       3  883601324
1333        5         1       4  875635748
1364      109         1       4  880563619
1379      181         1       3  878962392
1523       95         1       5  879197329
1928      268         1       3  875742341

In [9]:
movies.columns

Index(['movie_id', 'title'], dtype='object')

In [10]:
ratings.columns
# it shows common column 'movie_id' in both DataFrames

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [11]:
# perform the merging operation, to all columns with the SAME NAME
movie_ratings = pd.merge(movies, ratings)
movie_ratings.columns

Index(['movie_id', 'title', 'user_id', 'rating', 'timestamp'], dtype='object')

In [12]:
movie_ratings.head(10)

   movie_id             title  user_id  rating  timestamp
0         1  Toy Story (1995)      308       4  887736532
1         1  Toy Story (1995)      287       5  875334088
2         1  Toy Story (1995)      148       4  877019411
3         1  Toy Story (1995)      280       4  891700426
4         1  Toy Story (1995)       66       3  883601324
5         1  Toy Story (1995)        5       4  875635748
6         1  Toy Story (1995)      109       4  880563619
7         1  Toy Story (1995)      181       3  878962392
8         1  Toy Story (1995)       95       5  879197329
9         1  Toy Story (1995)      268       3  875742341

In [13]:
movie_ratings.shape

(100000, 5)

In [14]:
print(movies.shape)
print(ratings.shape)
print(movie_ratings.shape)

(1682, 2)
(100000, 4)
(100000, 5)

In [15]:
movies.columns = ['m_id', 'title']
movies.columns

Index(['m_id', 'title'], dtype='object')

In [16]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [17]:
movies.columns

Index(['m_id', 'title'], dtype='object')

In [18]:
# there is no mattching column name
# set parameter 'left_on' and 'right_on'
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()

   m_id             title  user_id  movie_id  rating  timestamp
0     1  Toy Story (1995)      308         1       4  887736532
1     1  Toy Story (1995)      287         1       5  875334088
2     1  Toy Story (1995)      148         1       4  877019411
3     1  Toy Story (1995)      280         1       4  891700426
4     1  Toy Story (1995)       66         1       3  883601324

In [19]:
movies = movies.set_index('m_id')
movies.head()

                  title
m_id
1      Toy Story (1995)
2      GoldenEye (1995)
3     Four Rooms (1995)
4     Get Shorty (1995)
5        Copycat (1995)

In [20]:
# parameter 'left_index=True' set the match column between 2 DataFrames
pd.merge(movies, ratings, left_index=True, right_on='movie_id').head(10)

                 title  user_id  movie_id  rating  timestamp
24    Toy Story (1995)      308         1       4  887736532
454   Toy Story (1995)      287         1       5  875334088
957   Toy Story (1995)      148         1       4  877019411
971   Toy Story (1995)      280         1       4  891700426
1324  Toy Story (1995)       66         1       3  883601324
1333  Toy Story (1995)        5         1       4  875635748
1364  Toy Story (1995)      109         1       4  880563619
1379  Toy Story (1995)      181         1       3  878962392
1523  Toy Story (1995)       95         1       5  879197329
1928  Toy Story (1995)      268         1       3  875742341

In [21]:
ratings = ratings.set_index('movie_id')
ratings.head()

          user_id  rating  timestamp
movie_id
242           196       3  881250949
302           186       3  891717742
377            22       1  878887116
51            244       2  880606923
346           166       1  886397596

In [22]:
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title  user_id  rating  timestamp
1  Toy Story (1995)      308       4  887736532
1  Toy Story (1995)      287       5  875334088
1  Toy Story (1995)      148       4  877019411
1  Toy Story (1995)      280       4  891700426
1  Toy Story (1995)       66       3  883601324

In [23]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [24]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

In [26]:
# since column 'color' is the common column, it becomes the matching column for merging operation
# inner join, only include a row in a result if the key thing to join is present in both DataFrame
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

In [27]:
# outer join includes everything regardless as long as the key thing is present in either DataFrame
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

In [28]:
# left join keeps all data of left DataFrame
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

In [30]:
# right join keeps all data of right DataFrame
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L